In [1]:
import pandas as pd
series1 = pd.Series([4.5, 7.2, -5.3, 3.6],index=['d','b','a','c'])
series1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [2]:
series1.reindex(['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [3]:
series1.reindex(['a','c','d'])

a   -5.3
c    3.6
d    4.5
dtype: float64

In [4]:
import numpy as np
data_array = np.arange(9)
#ndarray有4個檢查的屬性
display(data_array.dtype)
display(data_array.shape)
display(data_array.size)
display(data_array.ndim)

dtype('int64')

(9,)

9

1

In [5]:
np.reshape(np.arange(9),(3,3))

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [6]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),
                   index=['a','c','d'],
                   columns=['台北','台中','高雄']
                   )
df1.reindex(columns=['台北','台中'],index=['a','d','c'])

   台北  台中
a   0   1
d   6   7
c   3   4

In [7]:
#series的drop()
series2 = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
display(series2.drop('a'))
display(series2.drop(['a','b']))

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

c    2.0
d    3.0
e    4.0
dtype: float64

In [10]:
#dataFrame的drop()
df2 = pd.DataFrame(np.arange(16).reshape((4,4)),
             index=['台北','台中', '台南', '高雄'],
             columns=['one', 'two', 'three', 'four'])

In [11]:
display(df2.drop(['台北'],axis=0))
display(df2.drop(axis=1,labels=['one']))
display(df2.drop(index=['台北']))
display(df2.drop(columns=['one']))

    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

    two  three  four
台北    1      2     3
台中    5      6     7
台南    9     10    11
高雄   13     14    15

    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

    two  three  four
台北    1      2     3
台中    5      6     7
台南    9     10    11
高雄   13     14    15

In [12]:
#內容值的搜尋
display(df2)
display(df2[[True,True,False,False]])
display(df2['one'] >= 8)
df2[df2['one'] >= 8]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

台北    False
台中    False
台南     True
高雄     True
Name: one, dtype: bool

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [13]:
#更改欄位名稱和索引名稱
#rename()
#index
#columns
display(df2.index)
display(df2.columns)

Index(['台北', '台中', '台南', '高雄'], dtype='object')

Index(['one', 'two', 'three', 'four'], dtype='object')

In [14]:
display(df2)
df2.columns = ['ONE','TWO','THREE','FOUR']
df2

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

    ONE  TWO  THREE  FOUR
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [15]:
df2.index = range(1,5)
df2

   ONE  TWO  THREE  FOUR
1    0    1      2     3
2    4    5      6     7
3    8    9     10    11
4   12   13     14    15

In [16]:
df2 = df2.rename(columns={'ONE':'one','TWO':'two','THREE':'three','FOUR':'four'})
df2

   one  two  three  four
1    0    1      2     3
2    4    5      6     7
3    8    9     10    11
4   12   13     14    15